app/controllers/bloggenres_controller.rb

  def index
    @data = Bloggenre.all
---
SELECT "bloggenres".* FROM "bloggenres"

  def add
    @bloggenre = Bloggenre.new
    if request.post? then
      @bloggenre = Bloggenre.create bloggenre_params
---
INSERT INTO "bloggenres" ("name", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "テスト"], ["memo", "だよーん"], ["created_at", "2018-01-31 23:27:39.414699"], ["updated_at", "2018-01-31 23:27:39.414699"]]

  def edit
    @bloggenre = Bloggenre.find params[:id]
    if request.patch? then
      @bloggenre.update bloggenre_params
---
SELECT  "bloggenres".* FROM "bloggenres" WHERE "bloggenres"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "bloggenres" SET "memo" = ?, "updated_at" = ? WHERE "bloggenres"."id" = ?  [["memo", "だよーん2"], ["updated_at", "2018-01-31 23:35:07.350239"], ["id", 1]]