app/controllers/blogposts_controller.rb

  def index
    @test = "お元気ですか？"
    @data = Blogpost.all.order('created_at desc')
    @genre = Bloggenre.all
---
SELECT "blogposts".* FROM "blogposts" ORDER BY created_at desc
SELECT "bloggenres".* FROM "bloggenres"

  def add
    @blogpost = Blogpost.new
    @genres = Bloggenre.all
    if request.post? then
      @blogpost = Blogpost.create blogposts_params
---
SELECT "bloggenres".* FROM "bloggenres"
INSERT INTO "blogposts" ("title", "read", "content", "bloggenre_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "title"], ["read", "test"], ["content", "cont"], ["bloggenre_id", 1], ["created_at", "2018-02-03 00:05:56.671412"], ["updated_at", "2018-02-03 00:05:56.671412"]]

  def edit
    @blogpost = Blogpost.find params[:id]
    if request.patch? then
      @blogpost.update blogposts_params
---
SELECT  "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogposts" SET "title" = ?, "updated_at" = ? WHERE "blogposts"."id" = ?  [["title", "title2"], ["updated_at", "2018-02-03 00:19:31.134342"], ["id", 1]]

  def delete
      @blogpost = Blogpost.find params[:id]
    if request.post? then
      @blogpost.destroy
---
SELECT  "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "blogposts" WHERE "blogposts"."id" = ?  [["id", 1]]