app/controllers/blogs_controller.rb

  def index
    page_size = 5
    @page_num = 0
    if params[:page] != nil then
      @page_num = params[:page].to_i
    end
    @data = Blogpost.all.order('created_at desc')
      .offset(page_size * @page_num)
      .limit(page_size)
    @blogconfig = Blogconfig.find 1
---
SELECT  "blogposts".* FROM "blogposts" ORDER BY created_at desc LIMIT ? OFFSET ?  [["LIMIT", 5], ["OFFSET", 0]]
SELECT  "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def show
    @blogpost = Blogpost.find params[:id]
    @blogconfig = Blogconfig.find 1
---
SELECT  "blogposts".* FROM "blogposts" WHERE "blogposts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]