app/controllers/blogconfigs_controller.rb

  def index
    @blogconfig = Blogconfig.find 1
---
SELECT  "blogconfigs".* FROM "blogconfigs" WHERE "blogconfigs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]