app/controllers/cards_controller.rb

SELECT "cards".* FROM "cards"
---
  def index
    @msg = "index page"
    @data = Card.all

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @msg = "show details"
    @data = Card.find(params[:id])

INSERT INTO "cards" ("title", "author", "price", "publisher", "memo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "あ"], ["author", "あ"], ["price", 2000], ["publisher", "あ"], ["memo", "miki"], ["created_at", "2018-01-22 00:03:11.256495"], ["updated_at", "2018-01-22 00:03:11.256495"]]
---
  def create
     if request.post? then
        Card.create(card_params)

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @msg = "update data"
    @card = Card.find(params[:id])

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "cards" SET "price" = ?, "memo" = ?, "updated_at" = ? WHERE "cards"."id" = ?  [["price", 3800], ["memo", "sago"], ["updated_at", "2018-01-22 01:12:29.381808"], ["id", 1]]
---
  def update
    obj = Card.find(params[:id])
    obj.update(card_params)

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "cards" WHERE "cards"."id" = ?  [["id", 4]]
---
  def delete
    obj =Card.find(params[:id])
    obj.destroy