app/controllers/messages_controller.rb

  def index
    @msg = 'Message data.'
    @data = Message.all
---
SELECT "messages".* FROM "messages"

  def show
    @msg = "Indexed data"
    @message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @message = Message.new message_params
      if @message.save then
---
INSERT INTO "messages" ("person_id", "title", "message", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["person_id", 1], ["title", "本の名前"], ["message", "面白い"], ["created_at", "2018-01-28 01:55:52.553924"], ["updated_at", "2018-01-28 01:55:52.553924"]]

  def edit
    @msg = "edit data. [id=" + params[:id] + "]"
    @message = Message.find(params[:id])
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    obj = Message.find(params[:id])
    obj.update(message_params)
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "messages" SET "person_id" = ?, "updated_at" = ? WHERE "messages"."id" = ?  [["person_id", 1], ["updated_at", "2018-01-28 04:39:24.129300"], ["id", 3]]

  def delete
    obj = Message.find(params[:id])
    obj.destroy
---
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "messages" WHERE "messages"."id" = ?  [["id", 1]]